[
    {
        "Title": "VMware Plugs Critical Flaws in Network Monitoring Product",
        "Link": "https://www.securityweek.com/vmware-plugs-critical-flaws-in-network-monitoring-product/",
        "Date": "2023-06-07",
        "Time": "15:01:07",
        "Summary": "VMware ships urgent patches to cover security defects that expose businesses to remote code execution attacks.\nThe post VMware Plugs Critical Flaws in Network Monitoring Product appeared first on SecurityWeek."
    },
    {
        "Title": "Hackers Issue ‘Ultimatum’ Over Payroll Data Breach",
        "Link": "https://www.securityweek.com/hackers-issue-ultimatum-over-payroll-data-breach/",
        "Date": "2023-06-07",
        "Time": "13:27:56",
        "Summary": "The Clop ransomware gang issued \"an ultimatum\" companies targeted in a recent large-scale hack of payroll data\nThe post Hackers Issue ‘Ultimatum’ Over Payroll Data Breach appeared first on SecurityWeek."
    },
    {
        "Title": "US, Israel Provide Guidance on Securing Remote Access Software",
        "Link": "https://www.securityweek.com/us-israel-provide-guidance-on-securing-remote-access-software/",
        "Date": "2023-06-07",
        "Time": "13:16:34",
        "Summary": "US and Israeli government agencies have published new guidance on preventing malicious exploitation of remote access software.\nThe post US, Israel Provide Guidance on Securing Remote Access Software appeared first on SecurityWeek."
    },
    {
        "Title": "OWASP’s 2023 API Security Top 10 Refines View of API Risks",
        "Link": "https://www.securityweek.com/owasps-2023-api-security-top-10-refines-view-of-api-risks/",
        "Date": "2023-06-07",
        "Time": "12:09:58",
        "Summary": "OWASP’s ranking for the major API security risks in 2023 has been published. The list includes many parallels with the 2019 list, some reorganizations/redefinitions, and some new concepts.\nThe post OWASP’s 2023 API Security Top 10 Refines View of API Risks appeared first on SecurityWeek."
    },
    {
        "Title": "Android’s June 2023 Security Update Patches Exploited Arm GPU Vulnerability",
        "Link": "https://www.securityweek.com/androids-june-2023-security-update-patches-exploited-arm-gpu-vulnerability/",
        "Date": "2023-06-07",
        "Time": "11:44:43",
        "Summary": "Google’s June 2023 security update for Android patches more than 50 vulnerabilities, including an Arm Mali GPU flaw exploited by spyware vendors.\nThe post Android’s June 2023 Security Update Patches Exploited Arm GPU Vulnerability appeared first on SecurityWeek."
    },
    {
        "Title": "ChatGPT Hallucinations Can Be Exploited to Distribute Malicious Code Packages",
        "Link": "https://www.securityweek.com/chatgpt-hallucinations-can-be-exploited-to-distribute-malicious-code-packages/",
        "Date": "2023-06-07",
        "Time": "11:21:36",
        "Summary": "Researchers show how ChatGPT/AI hallucinations can be exploited to distribute malicious code packages to unsuspecting software developers.\nThe post ChatGPT Hallucinations Can Be Exploited to Distribute Malicious Code Packages appeared first on SecurityWeek."
    },
    {
        "Title": "Blumira Raises $15 Million for SMB-Tailored XDR Platform",
        "Link": "https://www.securityweek.com/blumira-raises-15-million-for-smb-tailored-xdr-platform/",
        "Date": "2023-06-07",
        "Time": "11:03:59",
        "Summary": "Blumira raises $15 million in Series B funding and launches a new XDR platform for small and medium-sized businesses (SMBs).\nThe post Blumira Raises $15 Million for SMB-Tailored XDR Platform appeared first on SecurityWeek."
    },
    {
        "Title": "Microsoft Will Pay $20M to Settle US Charges of Illegally Collecting Children’s Data",
        "Link": "https://www.securityweek.com/microsoft-will-pay-20m-to-settle-us-charges-of-illegally-collecting-childrens-data/",
        "Date": "2023-06-07",
        "Time": "10:41:29",
        "Summary": "Microsoft will pay a fine of $20 million to settle FTC charges that it illegally collected the data of children who signed up for Xbox.\nThe post Microsoft Will Pay $20M to Settle US Charges of Illegally Collecting Children’s Data appeared first on SecurityWeek."
    },
    {
        "Title": "KeePass Update Patches Vulnerability Exposing Master Password",
        "Link": "https://www.securityweek.com/keepass-update-patches-vulnerability-exposing-master-password/",
        "Date": "2023-06-06",
        "Time": "14:01:00",
        "Summary": "KeePass 2.54 patches a vulnerability allowing attackers to retrieve the cleartext master password from a memory dump.\nThe post KeePass Update Patches Vulnerability Exposing Master Password appeared first on SecurityWeek."
    },
    {
        "Title": "AntChain, Intel Create New Privacy-Preserving Computing Platform for AI Training",
        "Link": "https://www.securityweek.com/antchain-intel-create-new-privacy-preserving-computing-platform-for-ai-training/",
        "Date": "2023-06-06",
        "Time": "13:51:59",
        "Summary": "AntChain has teamed up with Intel for a Massive Data Privacy-Preserving Computing Platform (MAPPIC) for AI machine learning. \nThe post AntChain, Intel Create New Privacy-Preserving Computing Platform for AI Training appeared first on SecurityWeek."
    },
    {
        "Title": "FBI: Sextortionist Campaigns Use Deepfakes to Target Children, Adults",
        "Link": "https://www.darkreading.com/attacks-breaches/fbi-sextortionist-campaigns-deepfakes-children-adults",
        "Date": "2023-06-07",
        "Time": "14:38:00",
        "Summary": "Threat actors are lifting public images and videos from the Internet, altering them, and posting them online in a new wave of sextortion campaigns."
    },
    {
        "Title": "The Case for a Federal Cyber-Insurance Backstop",
        "Link": "https://www.darkreading.com/operations/the-case-for-a-federal-cyber-insurance-backstop",
        "Date": "2023-06-07",
        "Time": "14:00:00",
        "Summary": "By stepping in to provide aid, the federal government could help protect companies, insurers, and the economy from the impact of a widespread, catastrophic cyberattack."
    },
    {
        "Title": "Cisco Touts New AI-Based Security, SSE Features",
        "Link": "https://www.darkreading.com/dr-tech/cisco-touts-new-ai-based-security-sse-features",
        "Date": "2023-06-07",
        "Time": "12:00:00",
        "Summary": "Cisco laid out its plans for artificial intelligence (AI) and a vision for unified cloud security during Cisco Live 2023."
    },
    {
        "Title": "Verizon DBIR: Social Engineering Breaches Double, Leading to Spiraling Ransomware Costs",
        "Link": "https://www.darkreading.com/threat-intelligence/verizon-dbir-social-engineering-breaches-spiraling-ransomware-costs",
        "Date": "2023-06-06",
        "Time": "22:08:00",
        "Summary": "Ransomware continues its runaway growth with median payments reaching $50,000 per incident."
    },
    {
        "Title": "Researchers Spot a Different Kind of Magecart Card-Skimming Campaign",
        "Link": "https://www.darkreading.com/attacks-breaches/different-kind-magecart-card-skimming-campaign",
        "Date": "2023-06-06",
        "Time": "21:55:17",
        "Summary": "In addition to injecting a card skimmer into target Magento, WooCommerce, Shopify, and WordPress sites, the threat actor is also hijacking targeted domains to deliver the malware to other sites."
    },
    {
        "Title": "Microsoft Preps $425M Payment for LinkedIn GDPR Violations",
        "Link": "https://www.darkreading.com/endpoint/microsoft-425m-payment-linkedin-gdpr-violations",
        "Date": "2023-06-06",
        "Time": "21:18:31",
        "Summary": "The company plans on disputing these fines once a final decision is made, but warned shareholders that it set aside the funds to pay it, nonetheless."
    },
    {
        "Title": "With SEC Rule Changes on the Horizon, Research Reveals Only 14% of CISOs Have Traits Desired for Cyber Expert Board Positions",
        "Link": "https://www.darkreading.com/operations/with-sec-rule-changes-on-the-horizon-new-research-reveals-only-14-of-cisos-have-traits-desired-for-cyber-expert-board-positions",
        "Date": "2023-06-06",
        "Time": "21:15:00",
        "Summary": ""
    },
    {
        "Title": "ILTA and Conversant Group Release Cybersecurity Benchmarking Survey of the Legal Industry",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/ilta-and-conversant-group-release-cybersecurity-benchmarking-survey-of-the-legal-industry",
        "Date": "2023-06-06",
        "Time": "21:10:00",
        "Summary": "Joint research highlights disconnect between legal IT and recommended cybersecurity practices."
    },
    {
        "Title": "Netskope Intelligent SSE Selected by Transdev to Secure and Connect its Hybrid Workforce",
        "Link": "https://www.darkreading.com/remote-workforce/netskope-intelligent-sse-selected-by-transdev-to-secure-and-connect-its-hybrid-workforce",
        "Date": "2023-06-06",
        "Time": "19:42:00",
        "Summary": "Implementation is part of Transdev's Cloud-First approach to better manage technological obsolescence."
    },
    {
        "Title": "Filling the Gaps: How to Secure the Future of Hybrid Work",
        "Link": "https://www.darkreading.com/operations/filling-the-gaps-how-to-secure-the-future-of-hybrid-work",
        "Date": "2023-06-06",
        "Time": "14:00:00",
        "Summary": "By enhancing remote management and adopting hardware-enforced security, productivity can continue without inviting extra cyber-risk."
    },
    {
        "Title": "US Aerospace Contractor Hacked With 'PowerDrop' Backdoor",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/us-aerospace-contractor-hacked-powerdrop-backdoor",
        "Date": "2023-06-06",
        "Time": "13:00:00",
        "Summary": "Hackers used a little to do a lot, cracking a high-value target with hardly more than the living-off-the-land tools (PowerShell especially) found on any standard Windows computer."
    },
    {
        "Title": "ChatGPT Hallucinations Open Developers to Supply Chain Malware Attacks",
        "Link": "https://www.darkreading.com/application-security/chatgpt-hallucinations-developers-supply-chain-malware-attacks",
        "Date": "2023-06-06",
        "Time": "12:00:00",
        "Summary": "Attackers could exploit a common AI experience — false recommendations — to spread malicious code via developers that use ChatGPT to create software."
    },
    {
        "Title": "Red Sift Launches Relevance Detection as GPT-4-Powered Asset Discovery and Classification Solution",
        "Link": "https://www.darkreading.com/operations/red-sift-launches-relevance-detection-as-gpt-4-powered-asset-discovery-and-classification-solution",
        "Date": "2023-06-05",
        "Time": "21:29:00",
        "Summary": "New AI feature enhances OnDOMAIN's capabilities to secure unknown vulnerabilities and strengthen network security posture."
    },
    {
        "Title": "Microsoft Links MOVEit Attack to Cl0p as British Airways, BBC Fall",
        "Link": "https://www.darkreading.com/application-security/microsoft-links-moveit-attack-cl0p-british-airways-fall",
        "Date": "2023-06-05",
        "Time": "21:22:00",
        "Summary": "Some billion-dollar organizations have already been identified as victims of the prolific ransomware group's latest exploit, amidst ongoing attacks."
    },
    {
        "Title": "2.5M Impacted by Enzo Biochem Data Leak After Ransomware Attack",
        "Link": "https://www.darkreading.com/attacks-breaches/2-5m-impacted-by-enzo-biochem-data-leak-after-ransomware-attack",
        "Date": "2023-06-05",
        "Time": "21:15:00",
        "Summary": "With the leak of information such as Social Security numbers, in addition to other protected information, 600,000 of the nearly 2.5 million affected are at risk for identity theft."
    },
    {
        "Title": "Gigabyte Slams Backdoor Shut With Attack-Killing BIOS Update",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/gigabyte-backdoor-attack-killing-bios-update",
        "Date": "2023-06-05",
        "Time": "20:41:57",
        "Summary": "A firmware update for hundreds of Gigabyte PC models gets rid of a backdoor capability that could be hijacked by cybercriminals, the company says."
    },
    {
        "Title": "Moonlighter Satellite Offers In-Orbit Target for Space Hackers",
        "Link": "https://www.darkreading.com/ics-ot/moonlighter-satellite-in-orbit-target-space-hackers",
        "Date": "2023-06-05",
        "Time": "17:14:55",
        "Summary": "Moonlighter, which offers red teams a chance at operational disruption, will be up for pwning at in August, timed with DEF CON."
    },
    {
        "Title": "Don't Overlook Twitter's Trove of Threat Intel for Enterprise Cybersecurity",
        "Link": "https://www.darkreading.com/threat-intelligence/twitters-trove-threat-intel-enterprise-security",
        "Date": "2023-06-05",
        "Time": "16:29:00",
        "Summary": "Social media data can provide critical clues to help get ahead of the next cyberattack, experts say."
    },
    {
        "Title": "Mass Exploitation of Zero-Day Bug in MOVEit File Transfer Underway",
        "Link": "https://www.darkreading.com/application-security/mass-exploitation-0-day-bug-imoveit-file-transfer-underway",
        "Date": "2023-06-05",
        "Time": "15:02:00",
        "Summary": "With shades of the GoAnywhere attacks, a cyber threat actor linked to FIN11 is leveraging a bug in the widely used managed file transfer product to steal data from organizations in multiple countries."
    },
    {
        "Title": "After 'Inception' Attack, New Due Diligence Requirements Are Needed",
        "Link": "https://www.darkreading.com/attacks-breaches/after-inception-attack-new-due-diligence-requirements-are-needed",
        "Date": "2023-06-05",
        "Time": "14:00:00",
        "Summary": "To stem supply chain attacks, forging a new dynamic of shared cybersecurity hygiene accountability is the right thing to do."
    },
    {
        "Title": "Varonis: Reducing Insider Threats Through Improved Data Security",
        "Link": "https://www.darkreading.com/risk/varonis-reducing-insider-threats-through-improved-data-security",
        "Date": "2023-06-05",
        "Time": "13:00:00",
        "Summary": "In this Fast Chat segment, Dark Reading's Terry Sweeney and Varonis co-founder and CEO Yaki Faitelson discuss why we’re still seeing internal data breaches."
    },
    {
        "Title": "Name That Edge Toon: Spring Chickens",
        "Link": "https://www.darkreading.com/edge/name-that-edge-toon-spring-chickens",
        "Date": "2023-06-05",
        "Time": "05:20:00",
        "Summary": "Come up with a clever caption, and our panel of experts will reward the winner with a $25 Amazon gift card."
    },
    {
        "Title": "PyPI's 2FA Requirements Don't Go Far Enough, Researchers Say",
        "Link": "https://www.darkreading.com/application-security/pypi-2fa-requirements-dont-go-far-enough",
        "Date": "2023-06-02",
        "Time": "20:39:00",
        "Summary": "The Python Package Index will require developers to better secure their accounts as cyberattacks ramp up, but protecting the software supply chain will take more than that."
    },
    {
        "Title": "'PostalFurious' SMS Attacks Target UAE Citizens for Data Theft",
        "Link": "https://www.darkreading.com/dr-global/postalfurious-sms-attacks-target-uae-citizens-data-theft",
        "Date": "2023-06-02",
        "Time": "19:21:00",
        "Summary": "SMS campaigns targeting members of the public in the United Arab Emirates have been detected."
    },
    {
        "Title": "'Picture-in-Picture' Obfuscation Spoofs Delta, Kohl's for Credential Harvesting",
        "Link": "https://www.darkreading.com/endpoint/picture-in-picture-obfuscation-spoofs-delta-kohls-credential-harvesting",
        "Date": "2023-06-02",
        "Time": "16:36:00",
        "Summary": "A recent campaign tricks victims into visiting credential harvesting sites by hiding malicious URLs behind photos advertising deals from trusted brands."
    },
    {
        "Title": "Streamers Ditch Netflix for Dark Web After Password Sharing Ban",
        "Link": "https://www.darkreading.com/application-security/streamers-netflix-dark-web-password-sharing-ban",
        "Date": "2023-06-02",
        "Time": "15:51:45",
        "Summary": "Disgruntled users are pursuing offers for \"full Netflix access\" at steeply discounted rates."
    },
    {
        "Title": "Want Sustainable Security? Find Middle Ground Between Tech & Education",
        "Link": "https://www.darkreading.com/operations/want-sustainable-security-find-the-middle-ground-between-technology-and-education",
        "Date": "2023-06-02",
        "Time": "14:00:00",
        "Summary": "The winning recipe for sustainable security combines strategic user education and tactical automation of well-constructed processes."
    },
    {
        "Title": "Apple Zero-Days, iMessage Used in 4-Year, Ongoing Spying Effort",
        "Link": "https://www.darkreading.com/endpoint/apple-zero-days-imessage-4-year-spying-ios",
        "Date": "2023-06-02",
        "Time": "13:51:39",
        "Summary": "Russia's FSB intelligence agency says the zero-click attacks range far beyond Kaspersky, and it has blamed them on the United States' NSA. Those allegations are thus far uncorroborated."
    },
    {
        "Title": "How CISOs Can Manage the Intersection of Security, Privacy, And Trust",
        "Link": "https://www.darkreading.com/microsoft/how-cisos-can-manage-the-intersection-of-security-privacy-and-trust",
        "Date": "2023-06-02",
        "Time": "13:50:00",
        "Summary": "Integrating a subject rights request tool with security and compliance solutions can help identify potential data conflicts more efficiently and with greater accuracy."
    },
    {
        "Title": "DNB Strengthens its Network Security Posture and Productivity With Ericsson Security Manager Solution",
        "Link": "https://www.darkreading.com/operations/dnb-strengthens-its-network-security-posture-and-productivity-with-ericsson-security-manager-solution",
        "Date": "2023-06-01",
        "Time": "21:20:00",
        "Summary": ""
    },
    {
        "Title": "Cyversity and United Airlines to Provide Cybersecurity Training Scholarships to Cyversity Members",
        "Link": "https://www.darkreading.com/operations/cyversity-and-united-airlines-to-provide-cybersecurity-training-scholarships-to-cyversity-members",
        "Date": "2023-06-01",
        "Time": "21:18:00",
        "Summary": "Program designed to equip women and underrepresented individuals with the necessary skills and knowledge to succeed in cybersecurity."
    },
    {
        "Title": "Tel Aviv Stock Exchange Selects CardinalOps to Reduce Risk of Breaches Due to Undetected Attacks",
        "Link": "https://www.darkreading.com/risk/tel-aviv-stock-exchange-selects-cardinalops-to-reduce-risk-of-breaches-due-to-undetected-attacks",
        "Date": "2023-06-01",
        "Time": "20:47:00",
        "Summary": "Enables financial services firm to operationalize MITRE ATT&CK with Splunk and eliminate detection coverage gaps based on organizational risk and priorities."
    },
    {
        "Title": "Amazon Pays $30.8M to Settle Ring Spying & Alexa Privacy Lawsuits",
        "Link": "https://www.darkreading.com/ics-ot/amazon-ring-and-alexa-pay-30-8m-to-settle-privacy-lawsuits",
        "Date": "2023-06-01",
        "Time": "19:41:00",
        "Summary": "The global e-commerce company will pay millions of dollars in two separate lawsuits because of privacy and security violations, the FTC says."
    },
    {
        "Title": "Jetpack WordPress Plug-in API Bug Triggers Mass Updates",
        "Link": "https://www.darkreading.com/endpoint/jetpack-wordpress-plugin-api-bug-mass-updates",
        "Date": "2023-06-01",
        "Time": "18:44:27",
        "Summary": "An audit uncovers an API-related security vulnerability dating back to Jetpack version 2.0 released in 2012 — and it affects millions of websites."
    },
    {
        "Title": "How Do I Reduce Security Tool Sprawl in My Environment?",
        "Link": "https://www.darkreading.com/edge-ask-the-experts/how-do-i-reduce-security-tool-sprawl-in-my-environment",
        "Date": "2023-06-01",
        "Time": "18:42:00",
        "Summary": "When it comes to tool consolidation, focus on platforms over products."
    },
    {
        "Title": "Sustained 'Red Deer' Phishing Attacks Impersonate Israel Post, Drop RATs",
        "Link": "https://www.darkreading.com/dr-global/sustained-red-deer-phishing-attacks-israel-post-rats",
        "Date": "2023-06-01",
        "Time": "17:17:00",
        "Summary": "The \"missed package\" phishing messages, likely the work of a hacking-for-hire group, bounds into inboxes, bearing ASyncRAT."
    },
    {
        "Title": "Google Drive Deficiency Allows Attackers to Exfiltrate Workspace Data Without a Trace",
        "Link": "https://www.darkreading.com/endpoint/google-drive-deficiency-exfiltrate-workspace-data",
        "Date": "2023-06-01",
        "Time": "17:00:58",
        "Summary": "No activity logging in the free subscription for Google's Web-based productivity suite exposes enterprises to insider and other threats, researchers say."
    },
    {
        "Title": "Where SBOMs Stand Today",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/where-sboms-stand-today",
        "Date": "2023-06-01",
        "Time": "17:00:00",
        "Summary": "It's been two years since Executive Order 14028. By using SBOMs as a standard, organizations can manage software risks, protect their reputation, and improve their cybersecurity posture."
    },
    {
        "Title": "Novel PyPI Malware Uses Compiled Python Bytecode to Evade Detection",
        "Link": "https://www.darkreading.com/application-security/novel-pypi-malware-compiled-python-bytecode-evade-detection",
        "Date": "2023-06-01",
        "Time": "16:47:00",
        "Summary": "In an already fraught environment surrounding the popular Python programming language software package manager, hackers are coming up with new ways to sneak malicious goodies past cybersecurity buffers."
    },
    {
        "Title": "Biometric Bypass: BrutePrint Makes Short Work of Fingerprint Security",
        "Link": "https://www.darkreading.com/endpoint/bruteprint-short-work-fingerprint-security",
        "Date": "2023-06-01",
        "Time": "15:50:34",
        "Summary": "Bugs in the biometric protections on Android phones and iPhones allow the limit on the number of tries to unlock the devices with a fingerprint can be bypassed, allowing automated brute-force attacks."
    },
    {
        "Title": "SolarWinds Transforms Brand to Signify Ongoing Evolution, Portfolio Expansion, and Customer Empowerment",
        "Link": "https://www.darkreading.com/operations/solarwinds-transforms-brand-to-signify-ongoing-evolution-portfolio-expansion-and-customer-empowerment",
        "Date": "2023-06-01",
        "Time": "13:32:00",
        "Summary": "Refreshed version of iconic SolarWinds logo and vibrant new brand color palette honor company’s historic success while highlighting future vision."
    },
    {
        "Title": "Top macOS Malware Threats: Here Are 6 to Watch",
        "Link": "https://www.darkreading.com/endpoint/top-macos-malware-threats-proliferate",
        "Date": "2023-06-01",
        "Time": "13:00:00",
        "Summary": "Apple's growing market share — in a shrinking PC market — and the growing use of Golang for malware development is pushing a gradual increase in malicious tools targeting macOS environments."
    },
    {
        "Title": "Dark Reading Launches Inaugural CISO Advisory Board",
        "Link": "https://www.darkreading.com/operations/dark-reading-launches-inaugural-ciso-advisory-board",
        "Date": "2023-06-01",
        "Time": "12:55:00",
        "Summary": "Ten chief information security officers from a variety of verticals will provide valuable insights to Dark Reading on what they see as the industry's most pressing issues."
    },
    {
        "Title": "Meet Charlotte, CrowdStrike's New Generative AI Assistant",
        "Link": "https://www.darkreading.com/dr-tech/meet-charlotte-crowdstrike-s-new-generative-ai-assistant",
        "Date": "2023-05-31",
        "Time": "22:00:00",
        "Summary": "Charlotte AI is the latest security-based generative AI assistant to hit the market."
    },
    {
        "Title": "Yet Another Toyota Cloud Data Breach Jeopardizes Thousands of Customers",
        "Link": "https://www.darkreading.com/ics-ot/toyota-cloud-data-breach-jeopardizes-thousands-customers",
        "Date": "2023-05-31",
        "Time": "21:08:00",
        "Summary": "The newly found misconfigured cloud services are discovered just two weeks after an initial data breach affecting millions came to light."
    },
    {
        "Title": "Can Cloud Services Encourage Better Login Security? Netflix's Accidental Model",
        "Link": "https://www.darkreading.com/endpoint/can-service-providers-encourage-better-login-security-netflix-accidental-model",
        "Date": "2023-05-31",
        "Time": "20:30:23",
        "Summary": "Netflix's unpopular password-sharing policy change had a positive cybersecurity silver lining. Can more B2C service providers nudge their users toward secure authentication?"
    },
    {
        "Title": "MacOS 'Migraine' Bug: Big Headache for Device System Integrity",
        "Link": "https://www.darkreading.com/endpoint/macos-migraine-bug-headache-device-system-integrity",
        "Date": "2023-05-31",
        "Time": "20:05:00",
        "Summary": "Microsoft says the vulnerability could allow cyberattackers with root access to bypass security protections and install malware."
    },
    {
        "Title": "Ways to Help Cybersecurity's Essential Workers Avoid Burnout",
        "Link": "https://www.darkreading.com/edge-articles/ways-to-help-cybersecurity-s-essential-workers-avoid-burnout",
        "Date": "2023-05-31",
        "Time": "19:30:00",
        "Summary": "To support and retain the people who protect assets against bad actors, organizations should create a more defensible environment."
    },
    {
        "Title": "What Apple's RSRs Reveal About Mac Patch Management",
        "Link": "https://www.darkreading.com/endpoint/what-apple-rsrs-reveal-about-mac-patch-management",
        "Date": "2023-05-31",
        "Time": "19:00:00",
        "Summary": "Apple's Rapid Security Response updates are designed to patch critical security vulnerabilities, but how much good can they do when patching is a weeks-long process?"
    },
    {
        "Title": "Investment May Be Down, but Cybersecurity Remains a Hot Sector",
        "Link": "https://www.darkreading.com/operations/investment-may-be-down-cybersecurity-remains-hot",
        "Date": "2023-05-31",
        "Time": "17:00:00",
        "Summary": "There's still a great deal of capital available for innovative companies helping businesses secure their IT environments."
    },
    {
        "Title": "Checkmarx Announces GenAI-powered AppSec Platform, Empowering Developers and AppSec Teams to Find and Fix Vulnerabilities Faster",
        "Link": "https://www.darkreading.com/application-security/checkmarx-announces-genai-powered-appsec-platform-empowering-developers-and-appsec-teams-to-find-and-fix-vulnerabilities-faster",
        "Date": "2023-05-31",
        "Time": "16:40:00",
        "Summary": "Powered by GPT-4, innovative new AI-driven capabilities lower application security (AppSec) risk and help security teams \"shift everywhere\" with speed and accuracy."
    },
    {
        "Title": "New eID Scheme Gives EU Citizens Easy Access to Public Services Online",
        "Link": "https://www.darkreading.com/operations/new-eid-scheme-gives-eu-citizens-easy-access-to-public-services-online",
        "Date": "2023-05-31",
        "Time": "16:24:00",
        "Summary": "The European Commission voted a new electronic identification scheme that creates new opportunities for EU citizens and businesses."
    },
    {
        "Title": "Mirai Variant Opens Tenda, Zyxel Gear to RCE, DDoS",
        "Link": "https://www.darkreading.com/endpoint/mirai-variant-tenda-zyxel-rce-ddos",
        "Date": "2023-05-31",
        "Time": "15:04:00",
        "Summary": "Researchers have observed several cyberattacks leveraging a botnet called IZ1H9, which exploits vulnerabilities in exposed devices and servers running on Linux."
    },
    {
        "Title": "Focus Security Efforts on Choke Points, Not Visibility",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/focus-security-efforts-on-choke-points-not-visibility",
        "Date": "2023-05-31",
        "Time": "14:00:00",
        "Summary": "By finding the places where attack paths converge, you can slash multiple exposures in one fix for more efficient remediation."
    },
    {
        "Title": "Salesforce 'Ghost Sites' Expose Sensitive Corporate Data",
        "Link": "https://www.darkreading.com/application-security/salesforce-ghost-sites-expose-sensitive-corporate-data",
        "Date": "2023-05-31",
        "Time": "13:00:00",
        "Summary": "Some companies have moved on from using Salesforce. But without remembering to fully deactivate their clouds, Salesforce won't move on from them."
    },
    {
        "Title": "Spotlight on 2023 Dan Kaminsky Fellow: Dr. Gus Andrews",
        "Link": "https://www.darkreading.com/edge/spotlight-on-2023-dan-kaminsky-fellow-dr-gus-andrews",
        "Date": "2023-05-31",
        "Time": "01:25:00",
        "Summary": "As the second Kaminsky Fellow, Andrews will study the use of threat intelligence to track campaigns against the human rights community."
    },
    {
        "Title": "Human-Assisted CAPTCHA-Cracking Services Supercharge Shopper Bots",
        "Link": "https://www.darkreading.com/application-security/human-assisted-captcha-cracking-services-supercharge-shopper-bots",
        "Date": "2023-05-30",
        "Time": "21:39:00",
        "Summary": "On-demand human solvers are now augmenting automated website cyberattacks, offering a better way around tougher anti-bot puzzles."
    },
    {
        "Title": "421M Spyware Apps Downloaded Through Google Play",
        "Link": "https://www.darkreading.com/application-security/421-spyware-apps-downloaded-google-play",
        "Date": "2023-05-30",
        "Time": "21:18:00",
        "Summary": "A Trojan SDK snuck past Google Play protections to infest 101 Android applications, bent on exfiltrating infected device data."
    },
    {
        "Title": "Undetected Attacks Against Middle East Targets Conducted Since 2020",
        "Link": "https://www.darkreading.com/dr-global/undetected-attacks-against-middle-east-conducted",
        "Date": "2023-05-30",
        "Time": "17:00:00",
        "Summary": "Targeted attacks against Saudi Arabia and other Middle East nations have been detected with a tool that's been in the wild since 2020."
    },
    {
        "Title": "9M Dental Patients Affected by LockBit Attack on MCNA",
        "Link": "https://www.darkreading.com/attacks-breaches/9-million-dental-patients-affected-lockbit-attack-mcna",
        "Date": "2023-05-30",
        "Time": "16:34:00",
        "Summary": "The government-sponsored dental and oral healthcare provider warned its customers that a March attack exposed sensitive data, some of which was leaked online by the ransomware group."
    },
    {
        "Title": "Pentagon Leaks Emphasize the Need for a Trusted Workforce",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/pentagon-leaks-emphasize-the-need-for-a-trusted-workforce",
        "Date": "2023-05-30",
        "Time": "14:00:00",
        "Summary": "Tightening access controls and security clearance alone won't prevent insider threat risks motivated by lack of trust or loyalty."
    },
    {
        "Title": "Top Cyberattacks Revealed in New Threat Intelligence Report",
        "Link": "https://www.darkreading.com/threat-intelligence/top-cyberattacks-revealed-in-new-threat-intelligence-report",
        "Date": "2023-05-29",
        "Time": "13:00:00",
        "Summary": "New report provides actionable intelligence about attacks, threat actors, and campaigns."
    },
    {
        "Title": "2 Lenses for Examining the Safety of Open Source Software",
        "Link": "https://www.darkreading.com/dr-tech/2-lenses-examining-safety-open-source-software",
        "Date": "2023-05-26",
        "Time": "21:03:04",
        "Summary": "Improving the security of open source repositories while keeping malicious components out requires a combination of technology and people."
    },
    {
        "Title": "130K+ Patients' Social Security Numbers Leaked in UHS of Delaware Data Breach",
        "Link": "https://www.darkreading.com/attacks-breaches/130k-patients-social-security-numbers-leaked-in-uhs-of-delaware-data-breach",
        "Date": "2023-05-26",
        "Time": "19:47:00",
        "Summary": ""
    },
    {
        "Title": "Tesla Whistleblower Leaks 100GB of Data, Revealing Safety Complaints",
        "Link": "https://www.darkreading.com/attacks-breaches/whistleblower-leaks-100gb-tesla-data-safety-complaints",
        "Date": "2023-05-26",
        "Time": "17:32:00",
        "Summary": "Informants have released data that includes thousands of safety complaints the company has received about its self-driving capability, as well as sensitive information regarding current and past employees."
    },
    {
        "Title": "Travel-Themed Phishing, BEC Campaigns Get Smarter as Summer Season Arrives",
        "Link": "https://www.darkreading.com/endpoint/travel-themed-phishing-bec-campaigns-smarter-summer-season",
        "Date": "2023-05-26",
        "Time": "16:45:26",
        "Summary": "Phishing campaigns targeting travelers have evolved from simple, easy-to-spot fraud attempts to highly sophisticated operations."
    },
    {
        "Title": "How Safe Is Your Wearable Device?",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/how-safe-is-your-wearable-device",
        "Date": "2023-05-26",
        "Time": "14:00:00",
        "Summary": "To mitigate risk, both developers and users must include security principles and technologies as core foundations in new devices."
    },
    {
        "Title": "Russia's War in Ukraine Shows Cyberattacks Can Be War Crimes",
        "Link": "https://www.darkreading.com/edge-articles/russia-war-ukraine-shows-cyberattacks-are-war-crimes",
        "Date": "2023-05-26",
        "Time": "00:15:00",
        "Summary": "Ukraine head of cybersecurity Victor Zhora says the world needs \"efficient legal instruments to confront cyber terrorism.\""
    },
    {
        "Title": "'Volt Typhoon' Breaks Fresh Ground for China-Backed Cyber Campaigns",
        "Link": "https://www.darkreading.com/ics-ot/volt-typhoon-breaks-fresh-ground-china-backed-cyber-campaigns",
        "Date": "2023-05-25",
        "Time": "21:53:00",
        "Summary": "This is the first incident where a threat actor from the country appears to be laying the groundwork for disruptive attacks in the future, researchers say."
    },
    {
        "Title": "Red Hat Tackles Software Supply Chain Security",
        "Link": "https://www.darkreading.com/dr-tech/red-hat-tackles-software-supply-chain-security",
        "Date": "2023-05-25",
        "Time": "21:50:00",
        "Summary": "The new Red Hat Trusted Software Supply Chain services help developers take a secure-by-design approach to build, deploy, and monitor software."
    },
    {
        "Title": "CosmicEnergy Malware Emerges, Capable of Electric Grid Shutdown",
        "Link": "https://www.darkreading.com/ics-ot/cosmicenergy-malware-emerges-electric-grid-shutdown",
        "Date": "2023-05-25",
        "Time": "21:30:09",
        "Summary": "Russian code that could tamper with industrial machines and toggle RTUs on and off was floating around VirusTotal for years before being noticed. It raises new questions about the state of OT security."
    },
    {
        "Title": "Lazarus Group Striking Vulnerable Windows IIS Web Servers",
        "Link": "https://www.darkreading.com/cloud/lazarus-group-striking-vulnerable-windows-iis-web-servers",
        "Date": "2023-05-25",
        "Time": "21:18:00",
        "Summary": "The infamous North Korean APT group is using Log4Shell, the 3CX supply chain attack, and other known vectors to breach Microsoft Web servers."
    },
    {
        "Title": "Netflix's Password-Sharing Ban Offers Security Upsides",
        "Link": "https://www.darkreading.com/endpoint/netflix-password-sharing-ban-offers-security-upsides",
        "Date": "2023-05-25",
        "Time": "20:52:00",
        "Summary": "The streaming giant is looking to bolster flagging subscription growth and profits, but security researchers say the move offers a perfect opportunity to encourage better password hygiene and account safety."
    },
    {
        "Title": "Perception Point Report Finds That Advanced Phishing Attacks Grew by 356% in 2022",
        "Link": "https://www.darkreading.com/endpoint/perception-point-report-finds-that-advanced-phishing-attacks-grew-by-356-in-2022",
        "Date": "2023-05-25",
        "Time": "19:48:00",
        "Summary": "Perception Point's 2023 Annual Report: Cybersecurity Trends & Insights' analyzes the most prevalent cyberattack trends amidst today's complex threat landscape, identifying an overall increase of 87% in the total number of attacks over the course of last year."
    },
    {
        "Title": "Memcyco Delivers Real-Time Brandjacking Detection and Protection Solution",
        "Link": "https://www.darkreading.com/dr-global/memcyco-delivers-real-time-brandjacking-detection-and-protection-solution",
        "Date": "2023-05-25",
        "Time": "19:24:00",
        "Summary": ""
    },
    {
        "Title": "Bank of Ghana Opens SOC to Enable Threat Intelligence Sharing",
        "Link": "https://www.darkreading.com/dr-global/bank-of-ghana-opens-soc-enable-threat-intelligence-sharing",
        "Date": "2023-05-25",
        "Time": "17:24:00",
        "Summary": "Bank of Ghana's security operations center will boost visibility into threats and enable threat intelligence sharing, it says."
    },
    {
        "Title": "'Operation Magalenha' Attacks Give a Window Into Brazil's Cybercrime Ecosystem",
        "Link": "https://www.darkreading.com/endpoint/-operation-magalenha-attacks-window-brazil-cybercrime-ecosystem",
        "Date": "2023-05-25",
        "Time": "14:56:00",
        "Summary": "A campaign against customers of Portuguese banks uses a capable financial malware strain dubbed PeepingTitle, written in the Delphi programming language."
    },
    {
        "Title": "Google Cloud Bug Allows Server Takeover From CloudSQL Service",
        "Link": "https://www.darkreading.com/cloud/google-cloud-bug-server-takeover-cloudsql-service",
        "Date": "2023-05-25",
        "Time": "14:18:20",
        "Summary": "Researchers could access sensitive data and steal secrets by exploiting a vulnerability in GCP's security layer, eventually running rampant in the environment."
    },
    {
        "Title": "Dangerous Regions: Isolating Branch Offices in High-Risk Countries",
        "Link": "https://www.darkreading.com/vulnerabilities-threats/dangerous-regions-isolating-branch-offices-in-high-risk-countries",
        "Date": "2023-05-25",
        "Time": "14:00:00",
        "Summary": "Organizations must be cautious about how they interact with other regions around the world in order to operate safely in an at-times adversarial landscape."
    },
    {
        "Title": "CISO Criminalization, Vague Cyber Disclosure Rules Create Angst for Security Teams",
        "Link": "https://www.darkreading.com/operations/criminalization-of-cisos-creating-angst-among-cyber-teams",
        "Date": "2023-05-25",
        "Time": "13:00:00",
        "Summary": "In the wake of the ex-Uber CISO verdict, CISOs ask for clearer rules and less uncertainty in managing disclosures, amid jail-time fears."
    },
    {
        "Title": "'Volt Typhoon' China-Backed APT Infiltrates US Critical Infrastructure Orgs",
        "Link": "https://www.darkreading.com/endpoint/-volt-typhoon-china-backed-apt-infiltrates-us-critical-infrastructure",
        "Date": "2023-05-24",
        "Time": "22:09:00",
        "Summary": "According to Microsoft and researchers, the state-sponsored threat actor could very well be setting up a contingency plan for disruptive attacks on the US in the wake of an armed conflict in the South China Sea."
    },
    {
        "Title": "Honeywell Releases Cyber Insights to Better Identify Cybersecurity Threats and Vulnerabilities",
        "Link": "https://www.darkreading.com/ics-ot/honeywell-releases-cyber-insights-to-better-identify-cybersecurity-threats-and-vulnerabilities-",
        "Date": "2023-05-24",
        "Time": "21:52:00",
        "Summary": "The new software-led solution enables organizations to defend against cybersecurity threats in their operational technology (OT) environments."
    },
    {
        "Title": "Harvard Pilgrim Health Care Notifies Individuals of Privacy Incident",
        "Link": "https://www.darkreading.com/endpoint/harvard-pilgrim-health-care-notifies-individuals-of-privacy-incident",
        "Date": "2023-05-24",
        "Time": "21:29:00",
        "Summary": ""
    },
    {
        "Title": "Technology Veterans James Wickett and Ken Johnson Launch DryRun Security to Bring Security to Developers",
        "Link": "https://www.darkreading.com/application-security/technology-veterans-james-wickett-and-ken-johnson-launch-dryrun-security-to-bring-security-to-developers",
        "Date": "2023-05-24",
        "Time": "21:27:00",
        "Summary": "DryRun security seeks to bridge the gap between developers and security professionals by automating security analysis in code reviews before deployment."
    },
    {
        "Title": "Appdome Launches Build-to-Test, Automated Testing Option for Protected Mobile Apps",
        "Link": "https://www.darkreading.com/mobile/appdome-launches-build-to-test-automated-testing-option-for-protected-mobile-apps",
        "Date": "2023-05-24",
        "Time": "21:20:00",
        "Summary": "New capability streamlines automated testing of cybersecurity and anti-fraud features in android and iOS apps in virtual and cloud testing suites."
    },
    {
        "Title": "Netwrix Report: Enterprises Suffer More Ransomware and Other Malware Attacks Than Smaller Organizations",
        "Link": "https://www.darkreading.com/endpoint/netwrix-report-enterprises-suffer-more-ransomware-and-other-malware-attacks-than-smaller-organizations",
        "Date": "2023-05-24",
        "Time": "20:50:00",
        "Summary": "Attackers primarily target on-premises IT infrastructures."
    },
    {
        "Title": "Threat Actors Compromise Barracuda Email Security Appliances",
        "Link": "https://www.darkreading.com/endpoint/threat-actors-compromise-barracuda-email-security-appliances",
        "Date": "2023-05-24",
        "Time": "19:54:00",
        "Summary": "The company's ESG appliances were breached, but their other services remain unaffected by the compromise."
    },
    {
        "Title": "Google's .zip, .mov Domains Give Social Engineers a Shiny New Tool",
        "Link": "https://www.darkreading.com/endpoint/google-zip-mov-domains-social-engineers-shiny-new-tool",
        "Date": "2023-05-24",
        "Time": "18:15:08",
        "Summary": "Security professionals warn that Google's new top-level domains, .zip and .mov, pose social engineering risks while providing little reason for their existence."
    },
    {
        "Title": "OAuth Flaw in Expo Platform Affects Hundreds of Third-Party Sites, Apps",
        "Link": "https://www.darkreading.com/endpoint/oauth-flaw-in-expo-platform-affects-hundreds-of-third-party-sites-apps",
        "Date": "2023-05-24",
        "Time": "17:45:00",
        "Summary": "A cybersecurity vulnerability found in an implementation of the social login functionality opens the door to account takeovers and more."
    },
    {
        "Title": "How Universities Can Bridge Cybersecurity's Gender Gap",
        "Link": "https://www.darkreading.com/operations/how-universities-can-bridge-cybersecurity-s-gender-gap",
        "Date": "2023-05-24",
        "Time": "17:00:00",
        "Summary": "It's time to invest in initiatives that engage young women in cybersecurity early and often."
    },
    {
        "Title": "Israeli Shipping, Logistics Companies Targeted in Watering Hole Attacks",
        "Link": "https://www.darkreading.com/dr-global/israeli-shipping-logistics-companies-targeted-in-watering-hole-attacks",
        "Date": "2023-05-24",
        "Time": "16:30:00",
        "Summary": "Researchers say the Iranian nation-state actor known as Tortoiseshell could be behind the attacks."
    },
    {
        "Title": "How AI Can Help Organizations Adapt and Recover From Cyberattacks",
        "Link": "https://www.darkreading.com/risk/how-ai-can-help-organizations-adapt-and-recover-from-cyberattacks",
        "Date": "2023-05-24",
        "Time": "16:00:00",
        "Summary": "Incident response playbooks and frameworks are leaving defenders ill-equipped to recover from the increasing number of successful cyberattacks. Developments in AI offer a new way for stretched teams to manage security incidents and heal swiftly."
    },
    {
        "Title": "5 Questions to Ask When Evaluating a New Cybersecurity Technology",
        "Link": "https://www.darkreading.com/operations/5-questions-to-ask-when-evaluating-a-new-cybersecurity-technology-",
        "Date": "2023-05-24",
        "Time": "14:00:00",
        "Summary": "Any new cybersecurity technology should be not just a neutral addition to a security stack but a benefit to the other technologies or people managing them."
    },
    {
        "Title": "Google Adds Guardrails to Keep AI in Check",
        "Link": "https://www.darkreading.com/dr-tech/google-adds-guardrails-to-keep-ai-in-check",
        "Date": "2023-05-24",
        "Time": "01:52:00",
        "Summary": "Companies are starting to address the misuse of artificial intelligence (AI). At Google I/O, for example, executives promised its AI has safety measures."
    },
    {
        "Title": "SuperMailer Abuse Bypasses Email Security for Super-Sized Credential Theft",
        "Link": "https://www.darkreading.com/endpoint/supermailer-abuse-email-security-super-sized-credential-theft",
        "Date": "2023-05-23",
        "Time": "21:25:00",
        "Summary": "Secure email gateways and end users alike are being fooled by a cyberattack campaign that's enjoying skyrocketing volumes against businesses in every industry, globally."
    },
    {
        "Title": "What Security Professionals Need to Know About Aggregate Cyber-Risk",
        "Link": "https://www.darkreading.com/edge-articles/what-security-professionals-need-to-know-about-aggregate-cyber-risk",
        "Date": "2023-05-23",
        "Time": "19:56:00",
        "Summary": "Widespread cyber incidents will happen, but unlike natural disasters, specific security controls can help prevent a catastrophe."
    },
    {
        "Title": "FBI: Human Trafficking Rings Force Job Seekers Into Cryptojacking Schemes",
        "Link": "https://www.darkreading.com/cloud/fbi-human-trafficking-rings-force-job-seekers-cryptokjacking-schemes",
        "Date": "2023-05-23",
        "Time": "19:38:00",
        "Summary": "Victims of the cybercrime schemes are coerced to participate through violence and having their belongings taken away."
    },
    {
        "Title": "A New Look for Risk in Awareness Training",
        "Link": "https://www.darkreading.com/omdia/a-new-look-for-risk-in-awareness-training",
        "Date": "2023-05-23",
        "Time": "17:00:00",
        "Summary": "Changes in the way risk is viewed are leading to changes in the way training is conducted."
    },
    {
        "Title": "Microsoft: BEC Attackers Evade 'Impossible Travel' Flags With Residential IP Addresses",
        "Link": "https://www.darkreading.com/endpoint/microsoft-bec-attackers-evade-impossible-travel-residential-ip-addresses",
        "Date": "2023-05-23",
        "Time": "14:52:00",
        "Summary": "Threat actors are circumventing geo-location-based security detections, using a combination of cybercrime-as-a-service platforms and the purchasing of local IP addresses."
    },
    {
        "Title": "Bridgestone CISO: Lessons From Ransomware Attack Include Acting, Not Thinking",
        "Link": "https://www.darkreading.com/ics-ot/bridgestone-ciso-lessons-ransomware-attack-acting-thinking",
        "Date": "2023-05-23",
        "Time": "14:00:42",
        "Summary": "A February 2022 attack knocked the giant tire maker's North American operations offline for several days."
    },
    {
        "Title": "Student Loan Breach Exposes 2.5M Records",
        "Link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
        "Date": "2022-08-31",
        "Time": "12:57:48",
        "Summary": "2.5 million people were affected, in a breach that could spell more trouble down the line."
    },
    {
        "Title": "Watering Hole Attacks Push ScanBox Keylogger",
        "Link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
        "Date": "2022-08-30",
        "Time": "16:00:43",
        "Summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool."
    },
    {
        "Title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
        "Link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
        "Date": "2022-08-29",
        "Time": "14:56:19",
        "Summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system."
    },
    {
        "Title": "Ransomware Attacks are on the Rise",
        "Link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
        "Date": "2022-08-26",
        "Time": "16:44:27",
        "Summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group."
    },
    {
        "Title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
        "Link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
        "Date": "2022-08-25",
        "Time": "18:47:15",
        "Summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed."
    },
    {
        "Title": "Twitter Whistleblower Complaint: The TL;DR Version",
        "Link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
        "Date": "2022-08-24",
        "Time": "14:17:04",
        "Summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk."
    },
    {
        "Title": "Firewall Bug Under Active Attack Triggers CISA Warning",
        "Link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
        "Date": "2022-08-23",
        "Time": "13:19:58",
        "Summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP."
    },
    {
        "Title": "Fake Reservation Links Prey on Weary Travelers",
        "Link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
        "Date": "2022-08-22",
        "Time": "13:59:06",
        "Summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels."
    },
    {
        "Title": "iPhone Users Urged to Update to Patch 2 Zero-Days",
        "Link": "https://threatpost.com/iphone-users-urged-to-update-to-patch-2-zero-days-under-attack/180448/",
        "Date": "2022-08-19",
        "Time": "15:25:56",
        "Summary": "Separate fixes to macOS and iOS patch respective flaws in the kernel and WebKit that can allow threat actors to take over devices and are under attack."
    },
    {
        "Title": "Google Patches Chrome’s Fifth Zero-Day of the Year",
        "Link": "https://threatpost.com/google-patches-chromes-fifth-zero-day-of-the-year/180432/",
        "Date": "2022-08-18",
        "Time": "14:31:38",
        "Summary": "An insufficient validation input flaw, one of 11 patched in an update this week, could allow for arbitrary code execution and is under active attack."
    },
    {
        "Title": "Service Rents Email Addresses for Account Signups",
        "Link": "https://krebsonsecurity.com/2023/06/service-rents-email-addresses-for-account-signups/",
        "Date": "2023-06-06",
        "Time": "20:09:13",
        "Summary": "One of the most expensive aspects of any cybercriminal operation is the time and effort it takes to create large numbers of new throwaway email accounts. Now a new service offers to help dramatically cut costs associated with large-scale spam and account creation campaigns, by paying people to sell their email account credentials and letting customers temporarily rent access to a vast pool of established accounts at major providers."
    },
    {
        "Title": "Ask Fitis, the Bear: Real Crooks Sign Their Malware",
        "Link": "https://krebsonsecurity.com/2023/06/ask-fitis-the-bear-real-crooks-sign-their-malware/",
        "Date": "2023-06-01",
        "Time": "16:15:34",
        "Summary": "Code-signing certificates are supposed to help authenticate the identity of software publishers, and provide cryptographic assurance that a signed piece of software has not been altered or tampered with. Both of these qualities make stolen or ill-gotten code-signing certificates attractive to cybercriminal groups, who prize their ability to add stealth and longevity to malicious software. This post is a deep dive on \"Megatraffer,\" a veteran Russian hacker who has practically cornered the underground market for malware focused code-signing certificates since 2015."
    },
    {
        "Title": "Discord Admins Hacked by Malicious Bookmarks",
        "Link": "https://krebsonsecurity.com/2023/05/discord-admins-hacked-by-malicious-bookmarks/",
        "Date": "2023-05-31",
        "Time": "00:19:17",
        "Summary": "A number of Discord communities focused on cryptocurrency have been hacked this past month after their administrators were tricked into running malicious Javascript code disguised as a Web browser bookmark."
    },
    {
        "Title": "Phishing Domains Tanked After Meta Sued Freenom",
        "Link": "https://krebsonsecurity.com/2023/05/phishing-domains-tanked-after-meta-sued-freenom/",
        "Date": "2023-05-26",
        "Time": "16:37:15",
        "Summary": "The number of phishing websites tied to domain name registrar Freenom dropped precipitously in the months surrounding a recent lawsuit from social networking giant Meta, which alleged the free domain name provider has a long history of ignoring abuse complaints about phishing websites while monetizing traffic to those abusive domains."
    },
    {
        "Title": "Interview With a Crypto Scam Investment Spammer",
        "Link": "https://krebsonsecurity.com/2023/05/interview-with-a-crypto-scam-investment-spammer/",
        "Date": "2023-05-23",
        "Time": "00:15:30",
        "Summary": "Social networks are constantly battling inauthentic bot accounts that send direct messages to users promoting scam cryptocurrency investment platforms. What follows is an interview with a Russian hacker responsible for a series of aggressive crypto spam campaigns that recently prompted several large Mastodon communities to temporarily halt new registrations. According to the hacker, their spam software has been in private use until the last few weeks, when it was released as open source code."
    },
    {
        "Title": "Russian Hacker “Wazawaka” Indicted for Ransomware",
        "Link": "https://krebsonsecurity.com/2023/05/russian-hacker-wazawaka-indicted-for-ransomware/",
        "Date": "2023-05-16",
        "Time": "21:33:43",
        "Summary": "A Russian man identified by KrebsOnSecurity in January 2022 as a prolific and vocal member of several top ransomware groups was the subject of two indictments unsealed by the Justice Department today. U.S. prosecutors say Mikhail Pavolovich Matveev, a.k.a. \"Wazawaka\" and \"Boriselcin\" worked with three different ransomware gangs that extorted hundreds of millions of dollars from companies, schools, hospitals and government agencies."
    },
    {
        "Title": "Re-Victimization from Police-Auctioned Cell Phones",
        "Link": "https://krebsonsecurity.com/2023/05/re-victimization-from-police-auctioned-cell-phones/",
        "Date": "2023-05-16",
        "Time": "12:20:58",
        "Summary": "Countless smartphones seized in arrests and searches by police forces across the United States are being auctioned online without first having the data on them erased, a practice that can lead to crime victims being re-victimized, a new study found. In response, the largest online marketplace for items seized in U.S. law enforcement investigations says it now ensures that all phones sold through its platform will be data-wiped prior to auction."
    },
    {
        "Title": "Microsoft Patch Tuesday, May 2023 Edition",
        "Link": "https://krebsonsecurity.com/2023/05/microsoft-patch-tuesday-may-2023-edition/",
        "Date": "2023-05-10",
        "Time": "01:19:58",
        "Summary": "Microsoft today released software updates to fix at least four dozen security holes in its Windows operating systems and other software, including patches for two zero-day vulnerabilities that are already being exploited in active attacks."
    },
    {
        "Title": "Feds Take Down 13 More DDoS-for-Hire Services",
        "Link": "https://krebsonsecurity.com/2023/05/feds-take-down-13-more-ddos-for-hire-services/",
        "Date": "2023-05-09",
        "Time": "14:05:44",
        "Summary": "The U.S. Federal Bureau of Investigation (FBI) this week seized 13 domain names connected to “booter” services that let paying customers launch crippling distributed denial-of-service (DDoS) attacks. Ten of the domains are reincarnations of DDoS-for-hire services the FBI seized in December 2022, when it charged six U.S. men with computer crimes for allegedly operating booters."
    },
    {
        "Title": "$10M Is Yours If You Can Get This Guy to Leave Russia",
        "Link": "https://krebsonsecurity.com/2023/05/10m-is-yours-if-you-can-get-this-guy-to-leave-russia/",
        "Date": "2023-05-05",
        "Time": "01:50:08",
        "Summary": "The U.S. government this week put a $10 million bounty on the head of a Russian man who for the past 18 years operated Try2Check, one of the cybercrime underground's most trusted services for checking the validity of stolen credit card data. U.S. authorities say 43-year-old Denis Kulkov's card-checking service made him at least $18 million, which he used to buy a Ferrari, Land Rover, and other luxury items."
    },
    {
        "Title": "Microsoft to Pay $20 Million Penalty for Illegally Collecting Kids' Data on Xbox",
        "Link": "https://thehackernews.com/2023/06/microsoft-to-pay-20-million-penalty-for.html",
        "Date": "2023-06-07",
        "Time": "18:51:00",
        "Summary": "Microsoft has agreed to pay a penalty of $20 million to settle U.S. Federal Trade Commission (FTC) charges that the company illegally collected and retained the data of children who signed up to use its Xbox video game console without their parents' knowledge or consent.\n\"Our proposed order makes it easier for parents to protect their children's privacy on Xbox, and limits what information"
    },
    {
        "Title": "Winning the Mind Game: The Role of the Ransomware Negotiator",
        "Link": "https://thehackernews.com/2023/06/winning-mind-game-role-of-ransomware.html",
        "Date": "2023-06-07",
        "Time": "16:49:00",
        "Summary": "Get exclusive insights from a real ransomware negotiator who shares authentic stories from network hostage situations and how he managed them.\nThe Ransomware Industry\nRansomware is an industry. As such, it has its own business logic: organizations pay money, in crypto-currency, in order to regain control over their systems and data.\nThis industry's landscape is made up of approximately 10-20"
    },
    {
        "Title": "New PowerDrop Malware Targeting U.S. Aerospace Industry",
        "Link": "https://thehackernews.com/2023/06/new-powerdrop-malware-targeting-us.html",
        "Date": "2023-06-07",
        "Time": "10:10:00",
        "Summary": "An unknown threat actor has been observed targeting the U.S. aerospace industry with a new PowerShell-based malware called PowerDrop.\n\"PowerDrop uses advanced techniques to evade detection such as deception, encoding, and encryption,\" according to Adlumin, which found the malware implanted in an unnamed domestic aerospace defense contractor in May 2023.\n\"The name is derived from the tool,"
    },
    {
        "Title": "New Malware Campaign Leveraging Satacom Downloader to Steal Cryptocurrency",
        "Link": "https://thehackernews.com/2023/06/new-malware-campaign-leveraging-satacom.html",
        "Date": "2023-06-06",
        "Time": "23:51:00",
        "Summary": "A recent malware campaign has been found to leverage Satacom downloader as a conduit to deploy stealthy malware capable of siphoning cryptocurrency using a rogue extension for Chromium-based browsers.\n\"The main purpose of the malware that is dropped by the Satacom downloader is to steal BTC from the victim's account by performing web injections into targeted cryptocurrency websites,\" Kaspersky"
    },
    {
        "Title": "Over 60K Adware Apps Posing as Cracked Versions of Popular Apps Target Android Devices",
        "Link": "https://thehackernews.com/2023/06/over-60k-adware-apps-posing-as-cracked.html",
        "Date": "2023-06-06",
        "Time": "18:47:00",
        "Summary": "Thousands of adware apps for Android have been found to masquerade as cracks or modded versions of popular applications to serve unwanted ads to users as part of a campaign ongoing since October 2022.\n\"The campaign is designed to aggressively push adware to Android devices with the purpose to drive revenue,\" Bitdefender said in a technical report shared with The Hacker News. \"However, the threat"
    },
    {
        "Title": "5 Reasons Why IT Security Tools Don't Work For OT",
        "Link": "https://thehackernews.com/2023/06/5-reasons-why-it-security-tools-dont.html",
        "Date": "2023-06-06",
        "Time": "17:14:00",
        "Summary": "Attacks on critical infrastructure and other OT systems are on the rise as digital transformation and OT/IT convergence continue to accelerate. Water treatment facilities, energy providers, factories, and chemical plants — the infrastructure that undergirds our daily lives could all be at risk. Disrupting or manipulating OT systems stands to pose real physical harm to citizens, environments, and"
    },
    {
        "Title": "Zero-Day Alert: Google Issues Patch for New Chrome Vulnerability - Update Now!",
        "Link": "https://thehackernews.com/2023/06/zero-day-alert-google-issues-patch-for.html",
        "Date": "2023-06-06",
        "Time": "15:51:00",
        "Summary": "Google on Monday released security updates to patch a high-severity flaw in its Chrome web browser that it said is being actively exploited in the wild.\nTracked as CVE-2023-3079, the vulnerability has been described as a type confusion bug in the V8 JavaScript engine. Clement Lecigne of Google's Threat Analysis Group (TAG) has been credited with reporting the issue on June 1, 2023.\n\"Type"
    },
    {
        "Title": "Cyclops Ransomware Gang Offers Go-Based Info Stealer to Cybercriminals",
        "Link": "https://thehackernews.com/2023/06/cyclops-ransomware-gang-offers-go-based.html",
        "Date": "2023-06-06",
        "Time": "12:27:00",
        "Summary": "Threat actors associated with the Cyclops ransomware have been observed offering an information stealer malware that's designed to capture sensitive data from infected hosts.\n\"The threat actor behind this [ransomware-as-a-service] promotes its offering on forums,\" Uptycs said in a new report. \"There it requests a share of profits from those engaging in malicious activities using its malware.\""
    },
    {
        "Title": "Chinese PostalFurious Gang Strikes UAE Users with Sneaky SMS Phishing Scheme",
        "Link": "https://thehackernews.com/2023/06/chinese-postalfurious-gang-strikes-uae.html",
        "Date": "2023-06-06",
        "Time": "10:00:00",
        "Summary": "A Chinese-speaking phishing gang dubbed PostalFurious has been linked to a new SMS campaign that's targeting users in the U.A.E. by masquerading as postal services and toll operators, per Group-IB.\nThe fraudulent scheme entails sending users bogus text messages asking them to pay a vehicle trip fee to avoid additional fines. The messages also contain a shortened URL to conceal the actual"
    },
    {
        "Title": "Zyxel Firewalls Under Attack! Urgent Patching Required",
        "Link": "https://thehackernews.com/2023/06/zyxel-firewalls-under-attack-urgent.html",
        "Date": "2023-06-06",
        "Time": "09:46:00",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday placed two recently disclosed flaws in Zyxel firewalls to its Known Exploited Vulnerabilities (KEV) catalog, based on evidence of active exploitation.\nThe vulnerabilities, tracked as CVE-2023-33009 and CVE-2023-33010, are buffer overflow vulnerabilities that could enable an unauthenticated attacker to cause a"
    },
    {
        "Title": "Microsoft: Lace Tempest Hackers Behind Active Exploitation of MOVEit Transfer App",
        "Link": "https://thehackernews.com/2023/06/microsoft-lace-tempest-hackers-behind.html",
        "Date": "2023-06-05",
        "Time": "17:33:00",
        "Summary": "Microsoft has officially linked the ongoing active exploitation of a critical flaw in the Progress Software MOVEit Transfer application to a threat actor it tracks as Lace Tempest.\n\"Exploitation is often followed by deployment of a web shell with data exfiltration capabilities,\" the Microsoft Threat Intelligence team said in a series of tweets today. \"CVE-2023-34362 allows attackers to"
    },
    {
        "Title": "The Annual Report: 2024 Plans and Priorities for SaaS Security",
        "Link": "https://thehackernews.com/2023/06/the-annual-report-2024-plans-and.html",
        "Date": "2023-06-05",
        "Time": "17:25:00",
        "Summary": "Over 55% of security executives report that they have experienced a SaaS security incident in the past two years — ranging from data leaks and data breaches to SaaS ransomware and malicious apps (as seen in figures 1 and 2). \nFigure 1. How many organizations have experienced a SaaS security incident within the past two years\nThe SaaS Security Survey Report: Plans and Priorities for 2024,"
    },
    {
        "Title": "Magento, WooCommerce, WordPress, and Shopify Exploited in Web Skimmer Attack",
        "Link": "https://thehackernews.com/2023/06/magento-woocommerce-wordpress-and.html",
        "Date": "2023-06-05",
        "Time": "11:59:00",
        "Summary": "Cybersecurity researchers have unearthed a new ongoing Magecart-style web skimmer campaign that's designed to steal personally identifiable information (PII) and credit card data from e-commerce websites.\nA noteworthy aspect that sets it apart from other Magecart campaigns is that the hijacked sites further serve as \"makeshift\" command-and-control (C2) servers, using the cover to facilitate the"
    },
    {
        "Title": "Brazilian Cybercriminals Using LOLBaS and CMD Scripts to Drain Bank Accounts",
        "Link": "https://thehackernews.com/2023/06/brazilian-cybercriminals-using-lolbas.html",
        "Date": "2023-06-05",
        "Time": "10:18:00",
        "Summary": "An unknown cybercrime threat actor has been observed targeting Spanish- and Portuguese-speaking victims to compromise online banking accounts in Mexico, Peru, and Portugal.\n\"This threat actor employs tactics such as LOLBaS (living-off-the-land binaries and scripts), along with CMD-based scripts to carry out its malicious activities,\" the BlackBerry Research and Intelligence Team said in a report"
    },
    {
        "Title": "Alarming Surge in TrueBot Activity Revealed with New Delivery Vectors",
        "Link": "https://thehackernews.com/2023/06/alarming-surge-in-truebot-activity.html",
        "Date": "2023-06-05",
        "Time": "10:01:00",
        "Summary": "A surge in TrueBot activity was observed in May 2023, cybersecurity researchers disclosed.\n\"TrueBot is a downloader trojan botnet that uses command and control servers to collect information on compromised systems and uses that compromised system as a launching point for further attacks,\" VMware's Fae Carlisle said.\nActive since at least 2017, TrueBot is linked to a group known as Silence that's"
    },
    {
        "Title": "New Linux Ransomware Strain BlackSuit Shows Striking Similarities to Royal",
        "Link": "https://thehackernews.com/2023/06/new-linux-ransomware-strain-blacksuit.html",
        "Date": "2023-06-03",
        "Time": "13:50:00",
        "Summary": "An analysis of the Linux variant of a new ransomware strain called BlackSuit has covered significant similarities with another ransomware family called Royal.\nTrend Micro, which examined an x64 VMware ESXi version targeting Linux machines, said it identified an \"extremely high degree of similarity\" between Royal and BlackSuit.\n\"In fact, they're nearly identical, with 98% similarities in"
    },
    {
        "Title": "Cloud Security Tops Concerns for Cybersecurity Leaders: EC-Council's Certified CISO Hall of Fame Report 2023",
        "Link": "https://thehackernews.com/2023/06/cloud-security-tops-concerns-for.html",
        "Date": "2023-06-03",
        "Time": "13:40:00",
        "Summary": "A survey of global cybersecurity leaders through the 2023 Certified CISO Hall of Fame Report commissioned by the EC-Council identified 4 primary areas of grave concern: cloud security, data security, security governance, and lack of cybersecurity talent.\nEC-Council, the global leader in cybersecurity education and training, released its Certified Chief Information Security Officer Hall of Fame"
    },
    {
        "Title": "FTC Slams Amazon with $30.8M Fine for Privacy Violations Involving Alexa and Ring",
        "Link": "https://thehackernews.com/2023/06/ftc-slams-amazon-with-308m-fine-for.html",
        "Date": "2023-06-03",
        "Time": "13:35:00",
        "Summary": "The U.S. Federal Trade Commission (FTC) has fined Amazon a cumulative $30.8 million over a series of privacy lapses regarding its Alexa assistant and Ring security cameras.\nThis comprises a $25 million penalty for breaching children's privacy laws by retaining their Alexa voice recordings for indefinite time periods and preventing parents from exercising their deletion rights.\n\"Amazon's history"
    },
    {
        "Title": "New Botnet Malware 'Horabot' Targets Spanish-Speaking Users in Latin America",
        "Link": "https://thehackernews.com/2023/06/new-botnet-malware-horabot-targets.html",
        "Date": "2023-06-02",
        "Time": "17:33:00",
        "Summary": "Spanish-speaking users in Latin America have been at the receiving end of a new botnet malware dubbed Horabot since at least November 2020.\n\"Horabot enables the threat actor to control the victim's Outlook mailbox, exfiltrate contacts' email addresses, and send phishing emails with malicious HTML attachments to all addresses in the victim's mailbox,\" Cisco Talos researcher Chetan Raghuprasad"
    },
    {
        "Title": "The Importance of Managing Your Data Security Posture",
        "Link": "https://thehackernews.com/2023/06/the-importance-of-managing-your-data.html",
        "Date": "2023-06-02",
        "Time": "15:46:00",
        "Summary": "Data security is reinventing itself. As new data security posture management solutions come to market, organizations are increasingly recognizing the opportunity to provide evidence-based security that proves how their data is being protected. But what exactly is data security posture, and how do you manage it? \nData security posture management (DSPM) became mainstream following the publication"
    },
    {
        "Title": "Camaro Dragon Strikes with New TinyNote Backdoor for Intelligence Gathering",
        "Link": "https://thehackernews.com/2023/06/camaro-dragon-strikes-with-new-tinynote.html",
        "Date": "2023-06-02",
        "Time": "15:38:00",
        "Summary": "The Chinese nation-state group known as Camaro Dragon has been linked to yet another backdoor that's designed to meet its intelligence-gathering goals.\nIsraeli cybersecurity firm Check Point, which dubbed the Go-based malware TinyNote, said it functions as a first-stage payload capable of \"basic machine enumeration and command execution via PowerShell or Goroutines.\"\nWhat the malware lacks in"
    },
    {
        "Title": "North Korea's Kimsuky Group Mimics Key Figures in Targeted Cyber Attacks",
        "Link": "https://thehackernews.com/2023/06/north-koreas-kimsuky-group-mimics-key.html",
        "Date": "2023-06-02",
        "Time": "11:15:00",
        "Summary": "U.S. and South Korean intelligence agencies have issued a new alert warning of North Korean cyber actors' use of social engineering tactics to strike think tanks, academia, and news media sectors.\nThe \"sustained information gathering efforts\" have been attributed to a state-sponsored cluster dubbed Kimsuky, which is also known by the names APT43, ARCHIPELAGO, Black Banshee, Emerald Sleet ("
    },
    {
        "Title": "MOVEit Transfer Under Attack: Zero-Day Vulnerability Actively Being Exploited",
        "Link": "https://thehackernews.com/2023/06/moveit-transfer-under-attack-zero-day.html",
        "Date": "2023-06-02",
        "Time": "08:55:00",
        "Summary": "A critical flaw in Progress Software's in MOVEit Transfer managed file transfer application has come under widespread exploitation in the wild to take over vulnerable systems.\nThe shortcoming, which is assigned the CVE identifier CVE-2023-34362, relates to a severe SQL injection vulnerability that could lead to escalated privileges and potential unauthorized access to the environment.\n\"An SQL"
    },
    {
        "Title": "Evasive QBot Malware Leverages Short-lived Residential IPs for Dynamic Attacks",
        "Link": "https://thehackernews.com/2023/06/evasive-qbot-malware-leverages-short.html",
        "Date": "2023-06-01",
        "Time": "21:41:00",
        "Summary": "An analysis of the \"evasive and tenacious\" malware known as QBot has revealed that 25% of its command-and-control (C2) servers are merely active for a single day.\nWhat's more, 50% of the servers don't remain active for more than a week, indicating the use of an adaptable and dynamic C2 infrastructure, Lumen Black Lotus Labs said in a report shared with The Hacker News.\n\"This botnet has adapted"
    },
    {
        "Title": "New Zero-Click Hack Targets iOS Users with Stealthy Root-Privilege Malware",
        "Link": "https://thehackernews.com/2023/06/new-zero-click-hack-targets-ios-users.html",
        "Date": "2023-06-01",
        "Time": "20:44:00",
        "Summary": "A previously unknown advanced persistent threat (APT) is targeting iOS devices as part of a sophisticated and long-running mobile campaign dubbed Operation Triangulation that began in 2019.\n\"The targets are infected using zero-click exploits via the iMessage platform, and the malware runs with root privileges, gaining complete control over the device and user data,\" Kaspersky said.\nThe Russian"
    },
    {
        "Title": "Unmasking XE Group: Experts Reveal Identity of Suspected Cybercrime Kingpin",
        "Link": "https://thehackernews.com/2023/06/unmasking-xe-group-experts-reveal.html",
        "Date": "2023-06-01",
        "Time": "20:25:00",
        "Summary": "Cybersecurity researchers have unmasked the identity of one of the individuals who is believed to be associated with the e-crime actor known as XE Group.\nAccording to Menlo Security, which pieced together the information from different online sources, \"Nguyen Huu Tai, who also goes by the names Joe Nguyen and Thanh Nguyen, has the strongest likelihood of being involved with the XE Group.\"\nXE"
    },
    {
        "Title": "Malicious PyPI Packages Using Compiled Python Code to Bypass Detection",
        "Link": "https://thehackernews.com/2023/06/malicious-pypi-packages-using-compiled.html",
        "Date": "2023-06-01",
        "Time": "17:46:00",
        "Summary": "Researchers have discovered a novel attack on the Python Package Index (PyPI) repository that employs compiled Python code to sidestep detection by application security tools.\n\"It may be the first supply chain attack to take advantage of the fact that Python bytecode (PYC) files can be directly executed,\" ReversingLabs analyst Karlo Zanki said in a report shared with The Hacker News.\nThe package"
    },
    {
        "Title": "How Wazuh Improves IT Hygiene for Cyber Security Resilience",
        "Link": "https://thehackernews.com/2023/06/how-wazuh-improves-it-hygiene-for-cyber.html",
        "Date": "2023-06-01",
        "Time": "17:24:00",
        "Summary": "IT hygiene is a security best practice that ensures that digital assets in an organization's environment are secure and running properly. Good IT hygiene includes vulnerability management, security configuration assessments, maintaining asset and system inventories, and comprehensive visibility into the activities occurring in an environment.\nAs technology advances and the tools used by"
    },
    {
        "Title": "Improved BlackCat Ransomware Strikes with Lightning Speed and Stealthy Tactics",
        "Link": "https://thehackernews.com/2023/06/improved-blackcat-ransomware-strikes.html",
        "Date": "2023-06-01",
        "Time": "14:49:00",
        "Summary": "The threat actors behind BlackCat ransomware have come up with an improved variant that prioritizes speed and stealth in an attempt to bypass security guardrails and achieve their goals.\nThe new version, dubbed Sphynx and announced in February 2023, packs a \"number of updated capabilities that strengthen the group's efforts to evade detection,\" IBM Security X-Force said in a new analysis.\nThe \""
    },
    {
        "Title": "N. Korean ScarCruft Hackers Exploit LNK Files to Spread RokRAT",
        "Link": "https://thehackernews.com/2023/06/n-korean-scarcruft-hackers-exploit.html",
        "Date": "2023-06-01",
        "Time": "12:28:00",
        "Summary": "Cybersecurity researchers have offered a closer look at the RokRAT remote access trojan that's employed by the North Korean state-sponsored actor known as ScarCruft.\n\"RokRAT is a sophisticated remote access trojan (RAT) that has been observed as a critical component within the attack chain, enabling the threat actors to gain unauthorized access, exfiltrate sensitive information, and potentially"
    },
    {
        "Title": "Active Mirai Botnet Variant Exploiting Zyxel Devices for DDoS Attacks",
        "Link": "https://thehackernews.com/2023/06/active-mirai-botnet-variant-exploiting.html",
        "Date": "2023-06-01",
        "Time": "09:47:00",
        "Summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a recently patched critical security flaw in Zyxel gear to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation.\nTracked as CVE-2023-28771 (CVSS score: 9.8), the issue relates to a command injection flaw impacting different firewall models that could enable an unauthenticated attacker"
    },
    {
        "Title": "Urgent WordPress Update Fixes Critical Flaw in Jetpack Plugin on Million of Sites",
        "Link": "https://thehackernews.com/2023/06/urgent-wordpress-update-fixes-critical.html",
        "Date": "2023-06-01",
        "Time": "09:31:00",
        "Summary": "WordPress has issued an automatic update to address a critical flaw in the Jetpack plugin that’s installed on over five million sites.\nThe vulnerability, which was unearthed during an internal security audit, resides in an API present in the plugin since version 2.0, which was released in November 2012.\n“This vulnerability could be used by authors on a site to manipulate any files in the"
    },
    {
        "Title": "Cybercriminals Targeting Apache NiFi Instances for Cryptocurrency Mining",
        "Link": "https://thehackernews.com/2023/05/cybercriminals-targeting-apache-nifi.html",
        "Date": "2023-05-31",
        "Time": "21:14:00",
        "Summary": "A financially motivated threat actor is actively scouring the internet for unprotected Apache NiFi instances to covertly install a cryptocurrency miner and facilitate lateral movement.\nThe findings come from the SANS Internet Storm Center (ISC), which detected a spike in HTTP requests for “/nifi” on May 19, 2023.\n“Persistence is achieved via timed processors or entries to cron,” said Dr."
    },
    {
        "Title": "Critical Firmware Vulnerability in Gigabyte Systems Exposes ~7 Million Devices",
        "Link": "https://thehackernews.com/2023/05/critical-firmware-vulnerability-in.html",
        "Date": "2023-05-31",
        "Time": "18:48:00",
        "Summary": "Cybersecurity researchers have found \"backdoor-like behavior\" within Gigabyte systems, which they say enables the UEFI firmware of the devices to drop a Windows executable and retrieve updates in an unsecure format.\nFirmware security firm Eclypsium said it first detected the anomaly in April 2023. Gigabyte has since acknowledged and addressed the issue.\n\"Most Gigabyte firmware includes a Windows"
    },
    {
        "Title": "Beware of Ghost Sites: Silent Threat Lurking in Your Salesforce Communities",
        "Link": "https://thehackernews.com/2023/05/beware-of-ghost-sites-silent-threat.html",
        "Date": "2023-05-31",
        "Time": "18:30:00",
        "Summary": "Improperly deactivated and abandoned Salesforce Sites and Communities (aka Experience Cloud) could pose severe risks to organizations, leading to unauthorized access to sensitive data.\nData security firm Varonis dubbed the abandoned, unprotected, and unmonitored resources “ghost sites.”\n“When these Communities are no longer needed, though, they are often set aside but not deactivated,” Varonis"
    },
    {
        "Title": "Microsoft Details Critical Apple macOS Vulnerability Allowing SIP Protection Bypass",
        "Link": "https://thehackernews.com/2023/05/microsoft-details-critical-apple-macos.html",
        "Date": "2023-05-31",
        "Time": "17:27:00",
        "Summary": "Microsoft has shared details of a now-patched flaw in Apple macOS that could be abused by threat actors with root access to bypass security enforcements and perform arbitrary actions on affected devices.\nSpecifically, the flaw – dubbed Migraine and tracked as CVE-2023-32369 – could be abused to get around a key security measure called System Integrity Protection (SIP), or “rootless,” which"
    },
    {
        "Title": "6 Steps to Effectively Threat Hunting: Safeguard Critical Assets and Fight Cybercrime",
        "Link": "https://thehackernews.com/2023/05/6-steps-to-effective-threat-hunting.html",
        "Date": "2023-05-31",
        "Time": "17:17:00",
        "Summary": "Finding threat actors before they find you is key to beefing up your cyber defenses. How to do that efficiently and effectively is no small task – but with a small investment of time, you can master threat hunting and save your organization millions of dollars.\nConsider this staggering statistic. Cybersecurity Ventures estimates that cybercrime will take a $10.5 trillion toll on the global"
    },
    {
        "Title": "Dark Pink APT Group Leverages TelePowerBot and KamiKakaBot in Sophisticated Attacks",
        "Link": "https://thehackernews.com/2023/05/dark-pink-apt-group-leverages.html",
        "Date": "2023-05-31",
        "Time": "14:28:00",
        "Summary": "The threat actor known as Dark Pink has been linked to five new attacks aimed at various entities in Belgium, Brunei, Indonesia, Thailand, and Vietnam between February 2022 and April 2023.\nThis includes educational institutions, government agencies, military bodies, and non-profit organizations, indicating the adversarial crew’s continued focus on high-value targets.\nDark Pink, also called"
    },
    {
        "Title": "RomCom RAT Using Deceptive Web of Rogue Software Sites for Covert Attacks",
        "Link": "https://thehackernews.com/2023/05/romcom-rat-using-deceptive-web-of-rogue.html",
        "Date": "2023-05-31",
        "Time": "14:00:00",
        "Summary": "The threat actors behind RomCom RAT are leveraging a network of fake websites advertising rogue versions of popular software at least since July 2022 to infiltrate targets.\nCybersecurity firm Trend Micro is tracking the activity cluster under the name Void Rabisu, which is also known as Tropical Scorpius (Unit 42) and UNC2596 (Mandiant).\n\"These lure sites are most likely only meant for a small"
    },
    {
        "Title": "Alert: Hackers Exploit Barracuda Email Security Gateway 0-Day Flaw for 7 Months",
        "Link": "https://thehackernews.com/2023/05/alert-hackers-exploit-barracuda-email.html",
        "Date": "2023-05-31",
        "Time": "10:55:00",
        "Summary": "Enterprise security firm Barracuda on Tuesday disclosed that a recently patched zero-day flaw in its Email Security Gateway (ESG) appliances had been abused by threat actors since October 2022 to backdoor the devices.\nThe latest findings show that the critical vulnerability, tracked as CVE-2023-2868 (CVSS score: N/A), has been actively exploited for at least seven months prior to its discovery."
    },
    {
        "Title": "Hackers Win $105,000 for Reporting Critical Security Flaws in Sonos One Speakers",
        "Link": "https://thehackernews.com/2023/05/hackers-win-105000-for-reporting.html",
        "Date": "2023-05-30",
        "Time": "17:59:00",
        "Summary": "Multiple security flaws uncovered in Sonos One wireless speakers could be potentially exploited to achieve information disclosure and remote code execution, the Zero Day Initiative (ZDI) said in a report published last week.\nThe vulnerabilities were demonstrated by three different teams from Qrious Secure, STAR Labs, and DEVCORE at the Pwn2Own hacking contest held in Toronto late last year,"
    },
    {
        "Title": "CAPTCHA-Breaking Services with Human Solvers Helping Cybercriminals Defeat Security",
        "Link": "https://thehackernews.com/2023/05/captcha-breaking-services-with-human.html",
        "Date": "2023-05-30",
        "Time": "17:46:00",
        "Summary": "Cybersecurity researchers are warning about CAPTCHA-breaking services that are being offered for sale to bypass systems designed to distinguish legitimate users from bot traffic.\n\"Because cybercriminals are keen on breaking CAPTCHAs accurately, several services that are primarily geared toward this market demand have been created,\" Trend Micro said in a report published last week.\n\"These"
    },
    {
        "Title": "Implementing Risk-Based Vulnerability Discovery and Remediation",
        "Link": "https://thehackernews.com/2023/05/implementing-risk-based-vulnerability.html",
        "Date": "2023-05-30",
        "Time": "17:25:00",
        "Summary": "In this day and age, vulnerabilities in software and systems pose a considerable danger to businesses, which is why it is essential to have an efficient vulnerability management program in place. To stay one step ahead of possible breaches and reduce the damage they may cause, it is crucial to automate the process of finding and fixing vulnerabilities depending on the level of danger they pose."
    },
    {
        "Title": "Sneaky DogeRAT Trojan Poses as Popular Apps, Targets Indian Android Users",
        "Link": "https://thehackernews.com/2023/05/sneaky-dogerat-trojan-poses-as-popular.html",
        "Date": "2023-05-30",
        "Time": "12:32:00",
        "Summary": "A new open source remote access trojan (RAT) called DogeRAT targets Android users primarily located in India as part of a sophisticated malware campaign.\nThe malware is distributed via social media and messaging platforms under the guise of legitimate applications like Opera Mini, OpenAI ChatGPT, and Premium versions of YouTube, Netflix, and Instagram.\n\"Once installed on a victim's device, the"
    },
    {
        "Title": "New BrutePrint Attack Lets Attackers Unlock Smartphones with Fingerprint Brute-Force",
        "Link": "https://thehackernews.com/2023/05/new-bruteprint-attack-lets-attackers.html",
        "Date": "2023-05-29",
        "Time": "20:01:00",
        "Summary": "Researchers have discovered an inexpensive attack technique that could be leveraged to brute-force fingerprints on smartphones to bypass user authentication and seize control of the devices.\nThe approach, dubbed BrutePrint, bypasses limits put in place to counter failed biometric authentication attempts by weaponizing two zero-day vulnerabilities in the smartphone fingerprint authentication (SFA"
    },
    {
        "Title": "AceCryptor: Cybercriminals' Powerful Weapon, Detected in 240K+ Attacks",
        "Link": "https://thehackernews.com/2023/05/acecryptor-cybercriminals-powerful.html",
        "Date": "2023-05-29",
        "Time": "17:45:00",
        "Summary": "A crypter (alternatively spelled cryptor) malware dubbed AceCryptor has been used to pack numerous strains of malware since 2016.\nSlovak cybersecurity firm ESET said it identified over 240,000 detections of the crypter in its telemetry in 2021 and 2022. This amounts to more than 10,000 hits per month.\nSome of the prominent malware families contained within AceCryptor are SmokeLoader, RedLine"
    },
    {
        "Title": "3 Challenges in Building a Continuous Threat Exposure Management (CTEM) Program and How to Beat Them",
        "Link": "https://thehackernews.com/2023/05/3-challenges-in-building-continuous.html",
        "Date": "2023-05-29",
        "Time": "17:17:00",
        "Summary": "If you're a cybersecurity professional, you're likely familiar with the sea of acronyms our industry is obsessed with. From CNAPP, to CWPP, to CIEM and all of the myriad others, there seems to be a new initialism born each day.\nIn this article, we'll look at another trending acronym – CTEM, which stands for Continuous Threat Exposure Management – and the often-surprising challenges that come"
    },
    {
        "Title": "New GobRAT Remote Access Trojan Targeting Linux Routers in Japan",
        "Link": "https://thehackernews.com/2023/05/new-gobrat-remote-access-trojan.html",
        "Date": "2023-05-29",
        "Time": "15:20:00",
        "Summary": "Linux routers in Japan are the target of a new Golang remote access trojan (RAT) called GobRAT.\n\"Initially, the attacker targets a router whose WEBUI is open to the public, executes scripts possibly by using vulnerabilities, and finally infects the GobRAT,\" the JPCERT Coordination Center (JPCERT/CC) said in a report published today.\nThe compromise of an internet-exposed router is followed by the"
    },
    {
        "Title": "Don't Click That ZIP File! Phishers Weaponizing .ZIP Domains to Trick Victims",
        "Link": "https://thehackernews.com/2023/05/dont-click-that-zip-file-phishers.html",
        "Date": "2023-05-29",
        "Time": "12:44:00",
        "Summary": "A new phishing technique called \"file archiver in the browser\" can be leveraged to \"emulate\" a file archiver software in a web browser when a victim visits a .ZIP domain.\n\"With this phishing attack, you simulate a file archiver software (e.g., WinRAR) in the browser and use a .zip domain to make it appear more legitimate,\" security researcher mr.d0x disclosed last week.\nThreat actors, in a"
    },
    {
        "Title": "PyPI Implements Mandatory Two-Factor Authentication for Project Owners",
        "Link": "https://thehackernews.com/2023/05/pypi-implements-mandatory-two-factor.html",
        "Date": "2023-05-29",
        "Time": "10:28:00",
        "Summary": "The Python Package Index (PyPI) announced last week that every account that maintains a project on the official third-party software repository will be required to turn on two-factor authentication (2FA) by the end of the year.\n\"Between now and the end of the year, PyPI will begin gating access to certain site functionality based on 2FA usage,\" PyPI administrator Donald Stufft said. \"In addition"
    },
    {
        "Title": "Chrome and Edge zero-day: “This exploit is in the wild”, so check your versions now",
        "Link": "https://nakedsecurity.sophos.com/2023/06/06/chrome-zero-day-this-exploit-is-in-the-wild-so-check-your-version-now/",
        "Date": "2023-06-06",
        "Time": "18:28:43",
        "Summary": "Chrome 0-day patched now, Edge patch coming soon."
    },
    {
        "Title": "MOVEit zero-day exploit used by data breach gangs: The how, the why, and what to do…",
        "Link": "https://nakedsecurity.sophos.com/2023/06/05/moveit-zero-day-exploit-used-by-data-breach-gangs-the-how-the-why-and-what-to-do/",
        "Date": "2023-06-05",
        "Time": "19:59:29",
        "Summary": "Little Bobby Tables is back!"
    },
    {
        "Title": "Researchers claim Windows “backdoor” affects hundreds of Gigabyte motherboards",
        "Link": "https://nakedsecurity.sophos.com/2023/06/02/researchers-claim-windows-backdoor-affects-hundreds-of-gigabyte-motherboards/",
        "Date": "2023-06-02",
        "Time": "18:56:58",
        "Summary": "It's a backdoor, Jim, but not as we know it... here's a sober look at this issue."
    },
    {
        "Title": "S3 Ep137: 16th century crypto skullduggery",
        "Link": "https://nakedsecurity.sophos.com/2023/06/01/s3-ep137-16th-century-crypto-skullduggery/",
        "Date": "2023-06-01",
        "Time": "18:45:58",
        "Summary": "Lots to learn, clearly explained in plain English... listen now! (Full transcript inside.)"
    },
    {
        "Title": "Serious Security: That KeePass “master password crack”, and what we can learn from it",
        "Link": "https://nakedsecurity.sophos.com/2023/05/31/serious-security-that-keepass-master-password-crack-and-what-we-can-learn-from-it/",
        "Date": "2023-05-31",
        "Time": "19:39:00",
        "Summary": "Here, in an admittedly discursive nutshell, is the fascinating story of CVE-2023-32784. (Short version: Don't panic.)"
    },
    {
        "Title": "Serious Security: Verification is vital – examining an OAUTH login bug",
        "Link": "https://nakedsecurity.sophos.com/2023/05/30/serious-security-verification-is-vital-examining-an-oauth-login-bug/",
        "Date": "2023-05-30",
        "Time": "18:59:21",
        "Summary": "What good is a popup asking for your approval if an attacker can bypass it simply by suppressing it?"
    },
    {
        "Title": "S3 Ep136: Navigating a manic malware maelstrom",
        "Link": "https://nakedsecurity.sophos.com/2023/05/25/s3-ep136-navigating-a-manic-malware-maelstrom/",
        "Date": "2023-05-25",
        "Time": "19:50:03",
        "Summary": "Latest episode - listen now. Full transcript inside..."
    },
    {
        "Title": "Ransomware tales: The MitM attack that really had a Man in the Middle",
        "Link": "https://nakedsecurity.sophos.com/2023/05/24/ransomware-tales-the-mitm-attack-that-really-had-a-man-in-the-middle/",
        "Date": "2023-05-24",
        "Time": "19:59:23",
        "Summary": "Another traitorous sysadmin story, this one busted by system logs that gave his game away..."
    },
    {
        "Title": "PyPI open-source code repository deals with manic malware maelstrom",
        "Link": "https://nakedsecurity.sophos.com/2023/05/23/pypi-open-source-code-repository-deals-with-manic-malware-maelstrom/",
        "Date": "2023-05-23",
        "Time": "18:45:32",
        "Summary": "Controlled outage used to keep malware marauders from gumming up the works. Learn what you can do to help in future..."
    },
    {
        "Title": "Phone scamming kingpin gets 13 years for running “iSpoof” service",
        "Link": "https://nakedsecurity.sophos.com/2023/05/22/phone-scamming-kingpin-gets-13-years-for-running-ispoof-service/",
        "Date": "2023-05-22",
        "Time": "18:58:49",
        "Summary": "Site marketing video promised total anonymity, but that was a lie. 170 arrested already. Potentially 1000s more to follow."
    }
]